
                ifndef _MODULE_GAME_RENDER_CURSOR_
                define _MODULE_GAME_RENDER_CURSOR_
; -----------------------------------------
; отображение игрового курсора
; In:
; Out:
; Corrupt:
; Note:
; -----------------------------------------
DrawCursor:     ; -----------------------------------------
                ; подготовка позиции вывода курсора
                ; -----------------------------------------
                LD A, (Mouse.PositionX)  
                LD A, (Mouse.PositionY)

                ; -----------------------------------------
                ; расчёт адреса
                ; -----------------------------------------
                LD HL, Game.Cursor.SpriteInfo

                ; -----------------------------------------
                ; чтение информации о спрайте
                ; -----------------------------------------

                ; установка флага порчи фона под курсором
                SET_RENDER_FLAG RESTORE_CURSOR_BIT

                RET
; -----------------------------------------
; восстановление фона под игровым курсором
; In:
; Out:
; Corrupt:
; Note:
; -----------------------------------------
RestoreCursor:  ; ---------------------------------------------
                ; 
                ; ---------------------------------------------

                ; сброс флага востановления фона под курсором
                RES_RENDER_FLAG RESTORE_CURSOR_BIT

                RET

                endif ; ~_MODULE_GAME_RENDER_CURSOR_
