
                ifndef _CORE_MODULE_DRAW_SPRITE_PIXEL_DRAW_SPRITE_
                define _CORE_MODULE_DRAW_SPRITE_PIXEL_DRAW_SPRITE_
; -----------------------------------------
; отображение спрайта без атрибутов
; In:
;   IX - указывает на структуру FUnit
; Out:
; Corrupt:
; Note:
; -----------------------------------------
Draw:           ; -----------------------------------------
                ; отсечение спрайта видимой областью экрана
                ; -----------------------------------------
                CALL Math.IntersectScr
                RET C                                                           ; выход, спрайт вне области видимости

                ; -----------------------------------------
                ; определение спрайта для отрисовки
                ; -----------------------------------------


                ; -----------------------------------------
                ; подготовка спрайта перед выводм на экран
                ; -----------------------------------------
                CALL Prepare

                ; -----------------------------------------
                ; вывод спрайт на экран
                ; -----------------------------------------

                RET

                display " - Draw Sprite : \t\t\t", /A, Draw, " = busy [ ", /D, $ - Draw, " bytes  ]"

                endif ; ~ _CORE_MODULE_DRAW_SPRITE_PIXEL_DRAW_SPRITE_
